{"sessions": [{"body": "<p>Welcome to PyCon Israel 2017!</p>\n<p>Try to arrive early to complete the registration.</p>", "speakers": [], "title": "Registration and breakfast", "track": "Key Notes", "sessionId": 168, "video": null, "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 08:00", "duration": "45min", "type": "Break"}, {"body": "<h3>Time to start the show!</h3>", "speakers": [["PyCon Israel Team", "http://il.pycon.org/wwwpyconIL/speakers/233"]], "title": "Opening session: Welcome to PyCon Israel 2017!", "track": "Key Notes", "sessionId": 234, "video": null, "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 08:45", "duration": "15min", "type": "Keynote"}, {"body": "<p><span>In the early days of Python, the \"F\" may have been a key to its early success.  It was just the sort of magic power that made hard problems easier and impossible problems possible.  It was what made you want to program in your spare time.  It made management ask probing questions such as \"who gave you permission to do this?\"  No, the \"F\" was an unstoppable force for good.  As Python has matured, discussions of the \"F\" have often given way to more serious topics such as Unicode, packaging, and backwards compatibility.   However, it never really went away.  In fact, it's been sitting their in plain sight all along--growing in power.  In this talk,  I'll give a forward-looking discussion of Python's future and exploiting the power of the \"F\".  </span></p>", "speakers": [["David Beazley", "http://il.pycon.org/wwwpyconIL/speakers/62"]], "title": "The \"F\" of Reinvention", "track": "Key Notes", "sessionId": 112, "video": "https://www.youtube.com/embed/5nXmq1PsoJ0?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 09:00", "duration": "60min", "type": "Keynote"}, {"body": "<p><span>Jessica McKellar is an entrepreneur, software engineer, and open source developer from San Francisco. She is a former Director for the Python Software Foundation, PyCon North America's Diversity Outreach Chair. For her outreach efforts in the Python community, she was awarded the O'Reilly Open Source Award in 2013.</span></p>\n", "speakers": [["Jessica McKellar", "http://il.pycon.org/wwwpyconIL/speakers/65"]], "title": "Not telling you my title ;)", "track": "Key Notes", "sessionId": 113, "video": "https://www.youtube.com/embed/p6ZzJQUw6EY?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 10:00", "duration": "60min", "type": "Keynote"}, {"body": "<p dir=\"ltr\"><span>The Sapir-Whorf hypothesis states that language limits cognition; that the words we use influence the thoughts we have. This happens in code, too: programmers using different programming languages solve problems differently.</span></p>\n<p dir=\"ltr\"><span>Can we use this to our advantage? Let's unit test C code with pytest. Let's do autocompletion with a single script that's both Python and Bash. Let's write a Django server and extend its working API in its admin interface. Let's talk about Whorfian Refactoring.</span></p>\n", "speakers": [["Dan Gittik", "http://il.pycon.org/wwwpyconIL/speakers/134"]], "title": "Dream in Code", "track": "Track 1", "sessionId": 164, "video": "https://www.youtube.com/embed/ha65vSmrqC4?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 11:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Let's have fun! In this session we'll look at cases of strange core and library behavior, explore weirdness of Python, discuss the dos and don'ts of cool hacks and learn some neat new tricks!</span></p>", "speakers": [["Noam Tenne", "http://il.pycon.org/wwwpyconIL/speakers/158"]], "title": "Python Peculiarities", "track": "Track 2", "sessionId": 177, "video": "https://www.youtube.com/embed/unYxEUsD5FA?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Mon, 06/12/2017 - 11:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Predicting client financial behaviour is usually done by financial data sources - such as client financial history, bank and credit statements, etc. In this talk we will review a different type of data source for risk assessment - features engineered from clickstream data gathered by Mixpanel. We will discuss what kind of features can be generated from clickstream data and how to generate these features using Pandas, what is the benefit of these unconventional features, what are the different correlations of the features with user financial behaviour and how can you apply clickstream data analysis to your problems in general. </span></p>", "speakers": [["Shir Meir Lador", "http://il.pycon.org/wwwpyconIL/speakers/118"]], "title": "5 simple steps to create meaningful features from clickstream data (with Pandas)", "track": "PyData", "sessionId": 178, "video": "https://www.youtube.com/embed/ggNsagP1HDI?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Mon, 06/12/2017 - 11:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>In Python 3.4, asyncio was introduced to the standard library. This module gives us the ability to build concurrency into our applications without threading or multiprocessing. During this talk, I will show examples of asyncio and discuss the how, when and why of its usage.</span></p>\n", "speakers": [["Sim Zacks", "http://il.pycon.org/wwwpyconIL/speakers/147"]], "title": "Practical usage of asyncio", "track": "Track 1", "sessionId": 165, "video": "https://www.youtube.com/embed/VrUn_ZXZXQ0?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 11:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Pyparsing is a mature, small and useful text parsing library that let's you define a grammar easily and succinctly. Amazingly, pyparsing is using a unique design pattern called \"Combinators\" which is leveraged even further by monadic syntax from functional programming, while feeling Pythonic and clean. We will study this unique approach and uncover its secrets.</span></p>", "speakers": [["Yoav Luft", "http://il.pycon.org/wwwpyconIL/speakers/144"]], "title": "Text Parsing: the Case for Monads", "track": "Track 2", "sessionId": 179, "video": "https://www.youtube.com/embed/ybY9X61uUGk?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Mon, 06/12/2017 - 11:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>The introduction of IoT and Big Data has disrupted the multi-billion dollar municipal water management industry. However, sensors sometimes malfunction and differentiating between sensor error and expected anomalous readings from events such as storms and floods can be extremely difficult. Traditionally to account for irregularities, municipalities hire analysts to manually sift through sensor data and modify values believed to be caused by sensor error, an extremely costly and error prone process. Recently the Microsoft Partner Catalyst team partnered with the industry to build an anomaly detection model to differentiate between irregular sensor readings and sensor error, and put the model into production using Sci-Kit Learn as well as Azure Event Hubs, Stream Analytics and PowerBI. In this session participants will receive a high level overview of the the sensor error detection problem, and learn how to build a production visualization pipeline for classification models in near real time for their own use.</span></p>", "speakers": [["Ari Bornstein", "http://il.pycon.org/wwwpyconIL/speakers/228"]], "title": "Real Time Sensor Anomaly Detection with  Sci-Kit Learn and the Azure Stack", "track": "PyData", "sessionId": 229, "video": "https://www.youtube.com/embed/Q61glJUcpmc?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Mon, 06/12/2017 - 11:30", "duration": "30min", "type": "Frontal"}, {"body": "", "speakers": [], "title": "Lunch Break", "track": "Key Notes", "sessionId": 167, "video": null, "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 12:00", "duration": "60min", "type": "Break"}, {"body": "<p><span>A year after my \"Python in the Serverless Era\" talk at PyCon IL 2016, it's time to revisit Python's role in the Serverless ecosystem. We’ll review new frameworks and use cases involving Python in this vibrant and emerging technology.</span></p>", "speakers": [["Benny Bauer", "http://il.pycon.org/wwwpyconIL/speakers/148"]], "title": "The State Of Python In The Serverless World", "track": "Track 1", "sessionId": 166, "video": "https://www.youtube.com/embed/hri4YuiLfcg?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 13:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>This example-heavy talk, might give you everything you need to start having fun with Django Channels. Channels allow us to add features such as real time communication to our apps; without giving up the framework we love. Now we can use websockets and stay pythonic. Perhaps more importantly they provide opportunities for fun. We may answer client’s demands for features such as messaging while maintaining a consistent stack. Further, no longer do we have to consider expensive SASS style solutions, which lack flexibility. From realtime-chat to collaborative drawing canvases, Ronnie demonstrates how simple and playful you may find channels. Finally, we will talk about the nut’s and bolts that make up this powerful tool.</span></p>", "speakers": [["Ronnie Sheer", "http://il.pycon.org/wwwpyconIL/speakers/138"]], "title": " Django Channels Teaching a mature framework new tricks", "track": "Track 2", "sessionId": 184, "video": "https://www.youtube.com/embed/j5hFlH206rM?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Mon, 06/12/2017 - 13:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>We introduce a scheme for population anomaly detection based on gaussianization through an adversarial autoencoder. This scheme is applicable to detection of 'soft' anomalies in arbitrarily distributed highly-dimensional data. A soft, or population, anomaly is characterized by a shift in the distribution of the data set, where certain elements appear with higher or lower probability than anticipated. Such anomalies must be detected by considering a large sample set rather than a single sample. Applications include, but not limited to, payment fraud trends, data exfiltration, and system security and health monitoring. We evaluate the scheme on credit card payment and DNS data exfiltration data and obtain both quantitative results and qualitative insights. We discuss our PyTorch implementation of deep gaussianization, and review implementation details, pitfalls, and performance. </span></p>", "speakers": [["David Tolpin", "http://il.pycon.org/wwwpyconIL/speakers/120"]], "title": "Population Anomaly Detection through Deep Gaussianization", "track": "PyData", "sessionId": 187, "video": "https://www.youtube.com/embed/WZM9FrMPpGI?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Mon, 06/12/2017 - 13:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Serverless applications in Python sounds, strange isn’t? In this talk I’ll explain how to build not only crop images or select data from DynamoDB, but build real application, what kind of troubles are we should expect, how to make decision is your task fit into serverless architecture in Python or may be you should use, general approach. How fast serverless applications written in Python, and more important how to scale it.</span></p>", "speakers": [["Andrii Soldatenko", "http://il.pycon.org/wwwpyconIL/speakers/137"]], "title": "Building Serverless applications with Python ", "track": "Track 1", "sessionId": 169, "video": "https://www.youtube.com/embed/Xu9bMBaEYMk?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 13:30", "duration": "45min", "type": "Frontal"}, {"body": "<p><span>When reviewing your Python applications for quality, we are constantly pushed to improve our ‘code coverage’ and improve our unit test quality, since so often we are caught out during upgrades and re factoring, by a lack of broad regression tests. As an experienced programmer who was a Python newby, the whole unit test backlog for existing code in my new job was terrifying, so I needed to do something different... Here are practical examples of using Python for web programming where writing unit tests as part of the initial development processes, using Test Driven Design (TDD) methodologies, not only creates reliable regression tests for future code quality and maintenance, but also speeds up the development time, and gives a clearer path to deployment. The focus and examples are on web development, but the lessons and ideas are good for other development areas.</span></p>\n", "speakers": [["Daniel (Yona) Simons", "http://il.pycon.org/wwwpyconIL/speakers/237"]], "title": "Unit tests and TDD does NOT have to be boring", "track": "Track 2", "sessionId": 238, "video": "https://www.youtube.com/embed/2cY9M9_z4Q8?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Mon, 06/12/2017 - 13:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Anomaly detection and time series forecasting are valuable in monitoring the financial and technical health of an organization. Proper modeling of time series requires accounting for periodic fluctuation; malicious users; data irregularity, saturation or scarcity; sudden peaks and drops. To account for these parameters, the modeler needs to select the proper model family, optimize the model parameters, validate the assumptions, and refine the process as needed. The task is even more complicated when one needs to build a self-service application that supports \"slicing and dicing\" any metric to its underlying components. In such a case, where the number of possible models can be counted by thousands, manual tuning is impossible. In this lecture, I show how a series of assumptions and simplifications allowed completing the modeling task in one week, using open source Python packages. I will review all the assumptions, their implications, and limitations. I will also show which modeling approach worked, and which didn't work in case of Automattic, the company behind WordPress.com, Jetpack and other projects, that serves more than 180,000,000 unique visitors a month in the US alone. I hope that this information will be useful in many data-driven organizations. </span></p>", "speakers": [["Boris Gorelik", "http://il.pycon.org/wwwpyconIL/speakers/128"]], "title": "Anomaly detection and future forecasting -- when \"good enough\" is good enough.", "track": "PyData", "sessionId": 188, "video": "https://www.youtube.com/embed/UwkNmXhWmfI?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Mon, 06/12/2017 - 13:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>In recant year Earth imaging satellites have shrink drastically in cost and size, it is now possible to obtain open satellite data on a weekly basis in high Spatial resolution. This talk will cover working with satellite data in python in serval tool rasterio that is based on the Geospatial Data Abstraction Library (GDAL) and NumPy and combine it with xarray a python model to working with Multidimensional Arrays. we will show example that make use of the Unique information in Earth imaging satellites like the Ability to get information about vegetation health by using data in wavelengths the human eye can't see. This talk is intended for novice and intermediate python developers who interested in using satellite imagery </span></p>\n", "speakers": [["Yaron Michl", "http://il.pycon.org/wwwpyconIL/speakers/143"]], "title": "Exploring and Analyzing Open Satellite Imagery data with python ", "track": "Track 2", "sessionId": 182, "video": "https://www.youtube.com/embed/EHEuR_qEyEg?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Mon, 06/12/2017 - 14:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Pandas is one of the first libraries someone deals with while learning data science with python. While being one of the best libraries for data analysis and data cleaning, pandas is full of bugs and gotchas. This talk will look inside those gotchas with detailed explanations and will provide the solutions for some of them. this talk will cover the common and rare pandas gotchas like: -NaN problems Errors due to Numpy and core python libraries Reindexing gotchas Boolean Gotchas</span></p>", "speakers": [["Prabhant Singh", "http://il.pycon.org/wwwpyconIL/speakers/123"]], "title": "Gotchas of Pandas", "track": "PyData", "sessionId": 189, "video": "https://www.youtube.com/embed/3GAEh3EKBho?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Mon, 06/12/2017 - 14:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>In this talk we will explain the lessons that we learned while creating and maintaining the oVirt Python SDK, and specially how we were able to multiply the performance by 20, doing some rather radical changes to its architecture. oVirt is an open source virtualzation management platform. The oVirt Python SDK is a library that simplifies the usage of its API for Python developers. It is intended to remove from the Python developer the burden of handling XML and HTTP, while granting access to all the functionality of the oVirt API. A key aspect of the Python SDK is that it is automatically generated from the specification of the API. It has always been like that, since its very inception. In version 4 of oVirt a new version of the API was introduced, together with a much more strong specification. That gave us the opportunity to re-architect the Python SDK, with the following goals in mind: * Make sure that all the API functionality can be used, now and in the future, automatically generating Python code that can be kept backwards compatible. * Drastically improve the performance of the Python XML parsing and rendering code, specially for large data sets. * Enable asynchronous HTTP, and pipe-lining of HTTP requests. This is of utmost importance for environments with high latency. During the talk we will explain why these are important goals for us, what were the challenges with the architecture of version 3 of the SDK, and we will show you the techniques, tools and, yes, the code, that we used to make version 4 of the SDK 20 times faster.</span></p>\n", "speakers": [["Juan Hernández", "http://il.pycon.org/wwwpyconIL/speakers/130"]], "title": "Lessons learned from the oVirt project which allowed us to multiply by 20 the performance of the Python SDK", "track": "Track 1", "sessionId": 170, "video": "https://www.youtube.com/embed/OSes4uzw0xE?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 14:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>J.P. Morgan has one of the largest Python codebases in the world. We will discuss the challenges of working with millions of lines of Python and how one can deal with those. We will also show you how Python makes it easy to achieve continuous delivery and continuous deployment approaches regardless of scale.</span></p>", "speakers": [["Wojciech Kokot", "http://il.pycon.org/wwwpyconIL/speakers/226"]], "title": "Continuous Delivery in Python on a Massive Scale", "track": "Track 2", "sessionId": 227, "video": null, "location": "Wohl Center, Movie hall", "time": "Mon, 06/12/2017 - 14:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>We'll discuss how to create stable environment using <a href=\"https://conda.io\">https://conda.io</a> both for development and production.</span></p>\n", "speakers": [["Miki Tebeka", "http://il.pycon.org/wwwpyconIL/speakers/121"]], "title": "All package managers suck, conda sucks less", "track": "PyData", "sessionId": 193, "video": "https://www.youtube.com/embed/ywsf3mmv6do?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Mon, 06/12/2017 - 14:30", "duration": "30min", "type": "Frontal"}, {"body": "", "speakers": [], "title": "Coffee Break", "track": "Key Notes", "sessionId": 172, "video": null, "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 15:00", "duration": "30min", "type": "Break"}, {"body": "<p><span>I will demonstrate use of ctypes, cffi, and cython to wrap c code, including a performance benchmark</span></p>", "speakers": [["Matti Picus", "http://il.pycon.org/wwwpyconIL/speakers/153"]], "title": "CFFI, CTypes, Cython - the good, the bad, the ugly", "track": "Track 1", "sessionId": 171, "video": "https://www.youtube.com/embed/tqx9VW7V3Lc?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 15:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>I will talk about the differences between the three implementations. Focusing on use cases in which each of them should be used and how each environment tackles performance issues (GIL, just-in-time and Goroutines). I will also evaluate performance impact in real life scenario.</span></p>\n", "speakers": [["Itay Weiss", "http://il.pycon.org/wwwpyconIL/speakers/146"]], "title": "CPython, Grumpy, PyPy - When, How, Why?", "track": "Track 2", "sessionId": 181, "video": "https://www.youtube.com/embed/_y00S29mK1A?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Mon, 06/12/2017 - 15:30", "duration": "45min", "type": "Frontal"}, {"body": "<p><span>Python is gaining speed as a leading data science programming language, alongside R. An essential part of data science is data visualization, something easily achieved with popular plotting library Matplotlib. While matplotlib is powerful and versatile, R has one advantage with respect to plotting: ggplot2, which easily generates beautiful charts out of the box. In this talk we will demonstrate how to painlessly generate eye candy charts with Matplotlib, using styles, color maps, full chart customization and clever subplotting with figures and axis objects. We'll also briefly discuss basic and advanced interactivity for Jupyter notebooks and beyond.</span></p>\n", "speakers": [["Tamir Lousky", "http://il.pycon.org/wwwpyconIL/speakers/119"]], "title": "From plotting to \"chart-porn\": Creating slick charts with Matplotlib", "track": "PyData", "sessionId": 191, "video": "https://www.youtube.com/embed/KOqoqKJTl6s?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Mon, 06/12/2017 - 15:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Write automated tests is one of the best ways to ensure high quality code and a peace of mind for both developer and her managers. In this session we'll learn how to write tests using pytest. We will start by introducing pytest and we will see how to use it to write unittest for brand new code. TDD style. Then we'll take a look at the case where you already have a lot of code without tests and consider how can we approach that problem. We'll see how to write integration tests and how to mock the rest of the world.</span></p>", "speakers": [["Gabor Szabo", "http://il.pycon.org/wwwpyconIL/speakers/156"]], "title": "Testing with PyTest", "track": "Track 1", "sessionId": 173, "video": "https://www.youtube.com/embed/nznkU7Em5ns?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 16:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Aspect oriented programming is a programming paradigm for dealing with cross-cutting concerns. Python enables AOP by using the built-in decorator feature. We will demonstrate how to use these concepts within a data science settings. We will cover: timing, caching, ssh tunneling, and interactive jupyter plotting</span></p>", "speakers": [["Uri Goren", "http://il.pycon.org/wwwpyconIL/speakers/124"]], "title": "Aspect oriented programming for Data science", "track": "PyData", "sessionId": 192, "video": "https://www.youtube.com/embed/g5_oqVv2SMk?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Mon, 06/12/2017 - 16:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>An introduction to the Brainfuck esoteric programming language, an `ASCII2bf` program, a `bf` interpreter in `bf`, and finally - we will live code a `bf` interpreter in Python (which is probably the simplest interesting example of a virtual machine)</span></p>\n", "speakers": [["Aur Saraf", "http://il.pycon.org/wwwpyconIL/speakers/157"]], "title": "Programming 'brainfuck' and virtual machines", "track": "Track 1", "sessionId": 174, "video": "https://www.youtube.com/embed/F5P6Q7vs_-Y?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 16:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>In a world where simply connecting random household appliances to the Internet is considered 'innovation', a counter-proposal must be presented. In this talk we explore the free-as-in-freedom technologies that enable developers to build real-life applications based on physical devices. Buzzwords will be harmed during this talk.</span></p>\n", "speakers": [["Yuval Adam", "http://il.pycon.org/wwwpyconIL/speakers/140"]], "title": "Putting Things on the Internet™", "track": "Track 2", "sessionId": 186, "video": "https://www.youtube.com/embed/rMmgzZ_tIe8?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Mon, 06/12/2017 - 16:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Apache beam is an open source framework that try to create uniform API for all data processing frameworks like spark, flume and storm. so you can write your code and run it on different platform without changing it. Google cloud data flow is a service that allows you to process your data with apache beam without deploying any server. Recently google has contribute python support for apache beam.​In this lecture we will explore apache beam model and run en example on Google cloud dataflow with python API</span></p>", "speakers": [["Moshe Shamy", "http://il.pycon.org/wwwpyconIL/speakers/126"]], "title": "Apache beam and google cloud dataflow", "track": "PyData", "sessionId": 190, "video": "https://www.youtube.com/embed/I-31_8dOiIs?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Mon, 06/12/2017 - 16:30", "duration": "30min", "type": "Frontal"}, {"body": "<p>It's been a long day...<br>\nLet's <strong>party!</strong></br></p>\n<h4><a href=\"http://il.pycon.org/wwwpyconIL/node/250\"><strong>Details available here</strong></a></h4>", "speakers": [["PyCon Israel Team", "http://il.pycon.org/wwwpyconIL/speakers/233"]], "title": "Party Time!", "track": "Key Notes", "sessionId": 251, "video": null, "location": "Wohl Center, Main Hall", "time": "Mon, 06/12/2017 - 17:30", "duration": "180min", "type": "Keynote"}, {"body": "", "speakers": [], "title": "Registration and breakfast", "track": "Key Notes", "sessionId": 176, "video": null, "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 08:00", "duration": "60min", "type": "Break"}, {"body": "<p dir=\"ltr\"><span>Over the last few years, Python has cemented its lead as the primary development language for machine learning and AI, among both researchers and engineers. Python is dominating this development niche because manual memory management is very important for numeric computing, and CPython exposes an efficient and practical API for low-level extensions. The rest of the Python ecosystem also relies on low-level extensions --- Python would be of little use for web programming without fast libraries for JSON and XML parsing, image manipulation and database connectivity. However, most Python users have little love for these native extensions that they rely on. Native extensions impose some inconveniences. More things can go wrong, and they're necessarily exceptional and less dynamic.</span></p>\n<p><br><span>In this talk, I'll argue that the Python community ought to accept native extensions as a necessary good, instead of a necessary evil. The language would get stronger at its strengths by ending its ambivalence about native extensions, and investing in better tooling. Individual developers would benefit from getting comfortable dropping down into Cython, and understanding how to read and build native libraries. This applies especially in the growing field of machine learning and artificial intelligence --- the biggest growth area in software development today.</span></br></p>\n", "speakers": [["Matthew Honnibal", "http://il.pycon.org/wwwpyconIL/speakers/110"]], "title": "Why Python's the best language for AI (and how to make it even better)", "track": "Key Notes", "sessionId": 175, "video": "https://www.youtube.com/embed/yJR3qCUB27I?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 09:00", "duration": "60min", "type": "Keynote"}, {"body": "<p><span>When writing a package (library) or even a simple module, providing it with a good API, is almost as important as its functionality itself (well, at least if you want some adoption), but what makes a good API? In this talk, I’ll provide some insights on that question by surveying the APIs that helped make projects such as Requests, Flask and Celery popular, while also reviewing technical implementations.</span></p>", "speakers": [["Noam Elfanbaum", "http://il.pycon.org/wwwpyconIL/speakers/150"]], "title": "Designing Pythonic APIs", "track": "Track 1", "sessionId": 194, "video": "https://www.youtube.com/embed/CrQQCa_AoWI?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 10:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>ROSE (short for Red Hat Open Source for Education) is a cross-community effort lead by Red Hat Israel that brings students from Tira and Ra'anana to the Red Hat offices to learn about the Linux operating system and Python programming. As part of the ROSE project, the students learn about Open Source, basic Linux shell skills, and Python programming. As a final project, they write an algorithm in Python for a self driving car in a race game. The project gives an excellent opportunity to 8th grade students to experience both the world of coding and communication with other communities that they are not regularly in contact with. How does this work? Why use Python of all the languages? How can coding bring people from different cultures closer? Can we make it fun? In this session, we will present the project structure, the team activities, the code competition and our experience leading this project last year. </span></p>", "speakers": [["Freddy Rolland", "http://il.pycon.org/wwwpyconIL/speakers/151"], ["Ori Rabin", "http://il.pycon.org/wwwpyconIL/speakers_info/152"]], "title": "Bringing people together with Python and Open Source", "track": "Track 2", "sessionId": 195, "video": "https://www.youtube.com/embed/41oxZr43Ih0?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Tue, 06/13/2017 - 10:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Neural networks work very well for many learning-based applications, and I assume you are already familiar with them. Programming neural network models is rather easy, thanks to software libraries such as Theano, TensorFlow and Keras that let you define and train complex network structures. However, these libraries assume a fixed (static) graph structure, and are tailored for the GPU. I will introduce a radically different approach, in which the graphs are dynamic, and constructed from scratch for every training example. This makes programming of complex networks with structure that depend on the input very easy. I will introduce the DyNet neural networks package, that supports this dynamic graph creation, and which also works very well on the CPU. The talk assumes familiarity with neural network models, and will focus on how to implement them with DyNet.</span></p>", "speakers": [["Yoav Goldberg", "http://il.pycon.org/wwwpyconIL/speakers/115"]], "title": "Dynamic Neural Networks with DyNet", "track": "PyData", "sessionId": 196, "video": "https://www.youtube.com/embed/8eYZz6kiuUA?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Tue, 06/13/2017 - 10:00", "duration": "45min", "type": "Frontal"}, {"body": "<p><span>At the conference I would like to talk about:</span></p>\n<ul><li>On-box and off-Box automation</li>\n<li><span>Networking and system automation with Python for DevOps</span></li>\n<li><span>Using REST-API with controllers</span></li>\n<li><span>Creating automation tools as web applications with Django </span></li>\n</ul><p> </p>\n<p><span>Packages I want to talk about:</span></p>\n<ul><li>netmiko</li>\n<li><span>paramiko</span></li>\n<li><span>pyvmomi </span><br>\n\t </br></li>\n</ul><p><span>The conference audience will gain knowledge in managing the IT environment through automation to develop DevOps tools with Python.</span></p>", "speakers": [["Arik Gelman", "http://il.pycon.org/wwwpyconIL/speakers/241"]], "title": "DevOps with Python", "track": "Track 1", "sessionId": 242, "video": "https://www.youtube.com/embed/p6dw0Eb7_Rs?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 10:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>In this talk we will introduce a powerful Python open source project called Lago, which allows you to create fully isolated virtualized environment and interact with it using a Python API. Based on a real-life example of testing a complex project, we will go over the cons of using legacy methods for running system tests, and we will show how Lago can be used to overcome them while introducing additional cool features, such as running the whole testing suite on your laptop!</span></p>\n", "speakers": [["Gal Ben Haim", "http://il.pycon.org/wwwpyconIL/speakers/154"], ["Nadav Goldin", "http://il.pycon.org/wwwpyconIL/speakers_info/155"]], "title": "Meet Lago, your personal opensource tool for building isolated testing environment in a breeze", "track": "Track 2", "sessionId": 198, "video": "https://www.youtube.com/embed/xEceDU3_DKM?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Tue, 06/13/2017 - 10:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Many languages have a way to abstract the database nicely in code - ORMs are everywhere. But SQLAlchemy is special, it's not only an ORM ( like the one Django has ), It's also \"The Python SQL Toolkit\" where you can replace complicated SQL queries with simple, clean and safe Python.</span></p>\n", "speakers": [["Moran Cohen", "http://il.pycon.org/wwwpyconIL/speakers/149"]], "title": "The magic of SQLAlchemy", "track": "Track 1", "sessionId": 199, "video": "https://www.youtube.com/embed/mY3fLzrOJNg?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 11:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Jenkins is a very useful tool for building automation systems. Jenkins jobs typically get written as a mix of shell scripts and plug-in invocations, but as Python developers we prefer to do things with Python. In this presentation we will look into various tricks for implementing Jenkins job logic in Python starting with running simple scripts and going up to passing objects around and running stateful applications.</span></p>\n", "speakers": [["Barak Korren", "http://il.pycon.org/wwwpyconIL/speakers/161"]], "title": "The snake and the butler, Jenkins as a Python execution platform", "track": "Track 2", "sessionId": 200, "video": "https://www.youtube.com/embed/8XsktryJQ0w?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Tue, 06/13/2017 - 11:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>In this session we will cover the history of semantic image segmentation, from old color based method, to edge based/ super pixel method, and finally go trough the recent revolutions in this area such as CRF and GAN. No prior knowledge is required, and this is more fun and light talk that passes the intuition behind the equations.</span></p>", "speakers": [["Shai Harel", "http://il.pycon.org/wwwpyconIL/speakers/116"]], "title": "Structured Predictions an historical overview", "track": "PyData", "sessionId": 201, "video": "https://www.youtube.com/embed/ikbDbvs_gyA?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Tue, 06/13/2017 - 11:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>We've been told to stop writing objects. We've been told to write more objects. But what exactly do we really write when we write something? In this talk, we cover the Python datamodels sources and how do they interact?, when to begin writing objects, what methods to start with that leverage the Python data models, and how to use the \"magic\" methods of Python. This talk assumes you know all of the basic builtin data structures of Python and have familiarity with operators. Which should we be doing? When? How?</span></p>", "speakers": [["Yam Peleg", "http://il.pycon.org/wwwpyconIL/speakers/160"]], "title": "\"Low Level\" Python - a Deep dive into the python sources", "track": "Track 1", "sessionId": 204, "video": "https://www.youtube.com/embed/lMjubDqRN9M?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 11:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Docker is the most popular platform to run Python applications within containers. Many companies are using this platform to either deploy micro-services or test the code changes before merging it to production. Docker has 3 extension points: Drivers, Plugins and user-facing API. I am going to focus on the latter (user-facing API) and by the end of the talk, you will learn Docker's REST API and know how to extend Docker capabilities using Python.</span></p>", "speakers": [["Boaz Shuster", "http://il.pycon.org/wwwpyconIL/speakers/145"]], "title": "Extend Docker using Python", "track": "Track 2", "sessionId": 205, "video": "https://www.youtube.com/embed/jUJWRZ0Tq0A?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Tue, 06/13/2017 - 11:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>We introduce a methodology for efficient monitoring of processes running on hosts in a corporate network. The methodology is based on collecting streams of system calls produced by all or selected processes on the hosts, and sending them over the network to an analytics server, where machine learning algorithms based on LSTM (Long-Short Term Memory) are used to identify changes in process behavior, due to malicious activity, hardware failures, or software errors. System call streams are enormous, and an efficient representation with performance guarantees independent of the level of activity on the host must be used. Some earlier work was based on processing of sequential streams of system calls, which does not scale well. Other approaches rely on computing frequencies of short sequences (n-grams) of system calls over a fixed time window. However, in this case information about temporal dynamics of the process is lost. In our methodology, vectors of counts of system calls are collected and sent for every monitored process at fixed short time intervals, e.g., 1 second. However, the analytics server processes sequences of system call vectors over longer time spans. This way, the performance guarantee is maintained through sending fixed amount of data per time unit independently of the activity on the host, but the temporal behavior is at least partially preserved. By varying the vector and sequence time durations, a balance between network and CPU load, on one hand, and monitoring accuracy, on the other hand, can be adjusted depending on performance and accuracy requirements. </span></p>", "speakers": [["Michael Dymshtis", "http://il.pycon.org/wwwpyconIL/speakers/127"]], "title": "Process Monitoring on Sequences  of System Call  Vectors", "track": "PyData", "sessionId": 206, "video": "https://www.youtube.com/embed/XeYABdyxN-Q?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Tue, 06/13/2017 - 11:30", "duration": "30min", "type": "Frontal"}, {"body": "", "speakers": [], "title": "Lunch Break", "track": "Key Notes", "sessionId": 202, "video": null, "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 12:00", "duration": "60min", "type": "Break"}, {"body": "<p><span><a data-entity-type=\"file\" data-entity-uuid=\"f3fb9c6f-ba8e-45af-824e-3db4a6ad7356\" href=\"/wwwpyconIL/sites/default/files/inline-files/Anton-Marchukov.pdf\">Anton-Marchukov.pdf</a>A great set of tools exists to check the source code for compliance with Python coding standards such as PEP 8. Those tools are useful to control code quality during code review and on continuous integration stage. However, the standards do not cover everything and each team may have additional coding guidelines in place. Conveniently the Python ecosystem allows easy creation of custom source code checks, so your local code style conventions that are outside of existing tools coverage should not be left for a manual review process only. This talk will focus on how automation of code checks outside of PEP 8 standard can be done.</span></p>\n", "speakers": [["Anton Marchukov", "http://il.pycon.org/wwwpyconIL/speakers/133"]], "title": "Custom Source Code Checks", "track": "Track 1", "sessionId": 207, "video": "https://www.youtube.com/embed/M6oo12hPmxw?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 13:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Facebook, Google and Apple mislead you to create crappy passwords, that can be cracked easily. I invite you to see a more realistic way to estimate your own passwords using python “zxcvbn” lib. This is a useful tool that can also help you making your customers’ passwords stronger, and your site more secured. </span></p>\n", "speakers": [["Alon Kiriati", "http://il.pycon.org/wwwpyconIL/speakers/223"]], "title": "“bluegiraffeplaysball” (or Make Passwords Great Again Using \"zxcvbn”)", "track": "Track 2", "sessionId": 225, "video": "https://www.youtube.com/embed/zEG2Gk7ZGig?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Tue, 06/13/2017 - 13:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>This talk will present the solution used to win 1st place in Nexar’s traffic light recognition challenge. We will go over the process of how to start with a basic deep learning model and improve it over time. The talk will focus on the ideas and process more than the technical implementation. No need for strong background in deep learning to understand all the concepts in this talk.</span></p>\n", "speakers": [["David Brailovsky", "http://il.pycon.org/wwwpyconIL/speakers/122"]], "title": "Recognizing Traffic Lights With Deep Learning", "track": "PyData", "sessionId": 209, "video": "https://www.youtube.com/embed/zhuj5zs6LL0?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Tue, 06/13/2017 - 13:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span><a data-entity-type=\"file\" data-entity-uuid=\"17f7a4fa-c53f-4d4a-b6aa-222f809b4f6e\" href=\"/wwwpyconIL/sites/default/files/inline-files/itzik-kasovitch.pdf\">itzik-kasovitch.pdf</a>Python is a dynamic language. On small code bases this property is helpful and might increase productivity. On medium to large code bases this might be an impediment. In this session I will introduce mypy, which introduces type hints into Python in attempt to solve that impediment.</span></p>\n", "speakers": [["Itzhak Kasovitch", "http://il.pycon.org/wwwpyconIL/speakers/163"]], "title": "mypy - Python's gradual typing implementation", "track": "Track 1", "sessionId": 210, "video": "https://www.youtube.com/embed/SEiSw1ATOrg?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 13:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Usage of AST ( Abstract Syntax Trees ) to extend Python language. I am going to show on a real example how to adopt the syntax of the language to adjust it and to adapt to one's needs. Probably based on reactive programming and semantics of the reactive programming environment.</span></p>", "speakers": [["Roman Koifman", "http://il.pycon.org/wwwpyconIL/speakers/222"]], "title": "Adopt dynamically Python syntax and semantics", "track": "Track 2", "sessionId": 224, "video": null, "location": "Wohl Center, Movie hall", "time": "Tue, 06/13/2017 - 13:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Today there is a great need for improoved performance and scalability even in the early stages of the data science process, in my talk I will discuss the limitations of pandas in terms of performance and show a few hands on examples for common data processing procedure using two frameworks: Dask and Numba </span></p>", "speakers": [["Yigal Weinberger", "http://il.pycon.org/wwwpyconIL/speakers/212"]], "title": "Data Science at Scale: Using dask and Numba for performane and scalability", "track": "PyData", "sessionId": 211, "video": "https://www.youtube.com/embed/Qwo9RiAC9RU?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Tue, 06/13/2017 - 13:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span><a data-entity-type=\"file\" data-entity-uuid=\"64e1706b-21d9-4912-bb3c-c163fd29d665\" href=\"/wwwpyconIL/sites/default/files/inline-files/Nir-Soffer.pdf\">Nir-Soffer.pdf</a>Contrary to the common belief, Python has real threads and even with the famous GIL, they can be used in useful ways. Vdsm is a heavily multi-threaded Python program, constantly juggling tens of threads waiting for blocking system calls. In this talk we will explore a real world thread synchronization problem taken from Vdsm's LVM cache module. We will demonstrate the problem using simple tests and show the unexpected solution.</span></p>\n", "speakers": [["Nir Soffer", "http://il.pycon.org/wwwpyconIL/speakers/162"]], "title": "Let me sleep on it - improving concurrency in unexpected ways", "track": "Track 1", "sessionId": 213, "video": "https://www.youtube.com/embed/blXPoemXyh8?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 14:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>The oVirt project contains Python, Java and Ruby SDKs, which are auto-generated from the API specification and they are using imperative concept. On the other hand Ansible modules have to be declarative and idempotent. In this talk we will present issues we've had during the development, the lessons we've learned, and how we've made Ansible modules declarative using imperative SDK. The development of Ansible modules is done in Python, so the Python developers will gain knowledge on how Ansible modules can be developed, and what things should be considered when writing Ansible modules.</span></p>\n", "speakers": [["Ondřej Macháček", "http://il.pycon.org/wwwpyconIL/speakers/142"]], "title": "Ansible modules for oVirt - bridging the gap between declarative and imperative worlds", "track": "Track 2", "sessionId": 214, "video": "https://www.youtube.com/embed/1wvbq7mzMvM?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Tue, 06/13/2017 - 14:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Luigi is workflow orchestration framework library developed by Spotify and being used extensively at Oracle. In this talk I will cover key design aspects of Luigi, the way we use it and what makes it so special</span></p>\n", "speakers": [["Boaz Menuhin", "http://il.pycon.org/wwwpyconIL/speakers/125"]], "title": "Luigi - Big data plumbing library", "track": "PyData", "sessionId": 215, "video": "https://www.youtube.com/embed/ualIMj9QZOw?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Tue, 06/13/2017 - 14:00", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Wonder of complicated could be to write a 'working' conversational chatbot engine using an opensource project? Maybe integrated with Facebook Messenger ? Well, this presentation, will guide you to develop a simple bot, with a sprinkle of AI and all in your hands, ready to be consumed and to learn how your bot could solve problems and make more awesome your life :)</span></p>", "speakers": [["Francesco Vollero", "http://il.pycon.org/wwwpyconIL/speakers/132"]], "title": "A primer to write a conversational chatbot in no time", "track": "Track 1", "sessionId": 216, "video": "https://www.youtube.com/embed/xO8UjlxPUm0?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 14:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Everybody agree that unit-tests are important, however learning how to write unit-tests is hard. Most of the instructional material you might try to read will use as its' examples some well behaved functions with known input and deterministic outputs. Code that is trivial to write tests around. However the real world isn't so well behaved. It has legacy code, it inspects the world, has side effects, calls external services and might have random components. Writing unit-tests for such a code is anything but trivial. One technique to allow writing unit-tests around such real world code is to replace all that ugliness with mocks, and the standard unittest.mock library is a grate tool for that. The abilities of this library surprised and delighted me in more then one occasion as I straggled to raise my code coverage. However, in my experience both the concept of mocking and the unittest.mock library are not widely known. I hope to help change that in a small way.</span></p>", "speakers": [["Chen Rotem Levy", "http://il.pycon.org/wwwpyconIL/speakers/139"]], "title": "Unit-testing in the real world with mock", "track": "Track 2", "sessionId": 217, "video": "https://www.youtube.com/embed/CPyBkFFXLr0?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Tue, 06/13/2017 - 14:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Hypothesis is an advanced testing library for Python. It lets you write tests which are parametrized by a source of examples, and then generates simple and comprehensible examples that make your tests fail. This lets you find more bugs in your code with less work.</span></p>", "speakers": [["Eli Gur", "http://il.pycon.org/wwwpyconIL/speakers/230"]], "title": "Hypothesis: Generating test cases", "track": "PyData", "sessionId": 231, "video": "https://www.youtube.com/embed/SIoEosE1HyE?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Tue, 06/13/2017 - 14:30", "duration": "30min", "type": "Frontal"}, {"body": "", "speakers": [], "title": "Coffee Break", "track": "Key Notes", "sessionId": 203, "video": null, "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 15:00", "duration": "30min", "type": "Break"}, {"body": "<p><span>When we get geographic data from sensors, be it indoor positioning, GPS, or anything else, we need to handle it correctly. We (of course) have a lot of tools in Python to do so. What if you get a ton of this data coming continuously and have to display it, make real-time calculations, controls, reports and other operations ? Let's see one of the possible approaches to this problem using AsyncIO, MongoDB, a web app and Pandas reports, including how I implemented it for some clients (a live demo, if internet access permits it).</span></p>", "speakers": [["Jonathan Schemoul", "http://il.pycon.org/wwwpyconIL/speakers/73"]], "title": "Handling geo-located data (people, vehicle fleets...) in real-time using Python and MongoDB", "track": "Track 1", "sessionId": 218, "video": "https://www.youtube.com/embed/sxVitlGv5nw?autoplay=0&start=0&rel=0", "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 15:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>Jupyter (formerly IPython) Notebook is a \"better REPL\" that can be easily extended. I'll demonstrate how writing new backends is a productive way to expose existing tools (e.g. Ansible) in a more interactive way.</span></p>", "speakers": [["Beni Cherniavsky-Paskin", "http://il.pycon.org/wwwpyconIL/speakers/141"]], "title": "Adding interactivity by extending Jupyter Notebook", "track": "Track 2", "sessionId": 219, "video": "https://www.youtube.com/embed/VtEs4FadJ2I?autoplay=0&start=0&rel=0", "location": "Wohl Center, Movie hall", "time": "Tue, 06/13/2017 - 15:30", "duration": "30min", "type": "Frontal"}, {"body": "<p><span>One of the main challenges of developing algorithms for a dynamic, data intensive, and \"noisy\" environment is being able to monitor system performance and understand the impact of each element or change. Using basic principles, we developed a model that estimates key performance metrics. Used in an unconventional way, the model allows us to gain significant insight on global system behavior and performance, and impact of updates to the core algorithm's logic. This model has proven extremely powerful at Via. We have developed and deployed the world's first operating system for on-demand dynamic public transit. Our solution is operating at scale in New-York, Chicago, DC, Paris and is growing rapidly to additional locations.</span></p>", "speakers": [["Elad Berkman", "http://il.pycon.org/wwwpyconIL/speakers/117"]], "title": "A physicist's approach to Data-Science", "track": "PyData", "sessionId": 220, "video": "https://www.youtube.com/embed/1I_eM99zsgs?autoplay=0&start=0&rel=0", "location": "Wohl Center, Hall #2", "time": "Tue, 06/13/2017 - 15:30", "duration": "30min", "type": "Frontal"}, {"body": "<h2>Time to wrap up the main event!</h2>\n<p>We'll have some closing notes to review the event and a ruffle with a cool surprise.</p>\n<p><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdqBkS6Jlq3A1tyuD3LAzjizRsCG7DyTXmvyrk9w-kbDYddxg/viewform?usp=sf_link\">Register here</a> to join the raffle and make sure to show up ;)</p>\n<p> </p>", "speakers": [], "title": "Closing session", "track": "Key Notes", "sessionId": 221, "video": null, "location": "Wohl Center, Main Hall", "time": "Tue, 06/13/2017 - 16:00", "duration": "60min", "type": "Keynote"}, {"body": "", "speakers": [], "title": "Workshops registration and breakfast at Bar-Ilan", "track": "Key Notes", "sessionId": 96, "video": null, "location": "Bar-Ilan CS lab 201 (604 on the map)", "time": "Wed, 06/14/2017 - 08:00", "duration": "60min", "type": "Break"}, {"body": "<p><span>We will try to get our hands dirty playing with python (micropython) on some wifi enabled (and/or bluetooth) micro-controllers, to build a project together.<br><br/>\nProposed project is a weather and air quality monitor station device with a full-color display showing the current values of the sensors as well. The device can send data upstream to a sensor network to share data with others.<br/><br/>\nWe will improve on work done at the PyCon FR workshop on the same subject.</br></span></p>\n<p><br/><span>People with their own ideas can come to the workshop too to learn how to do it (if you need specific hardware, bring it :)).</span></p>", "speakers": [["Jonathan Schemoul", "http://il.pycon.org/wwwpyconIL/speakers/73"]], "title": "Let's build a device together using Python!", "track": "Track 1", "sessionId": 97, "video": null, "location": "Bar-Ilan CS lab 201 (604 on the map)", "time": "Wed, 06/14/2017 - 09:00", "duration": "480min", "type": "Workshop"}, {"body": "<p><span>In this workshop we will see how easy it can be to implement fully automated system test for your Python application, that would integrate easily in your Development or Continuous Integration flow. We will use the open source Python project - Lago, which allows you to create fully isolated environments and interact with them using a Python API. We will go through the steps of building complete end- to-end system tests, which includes: deployment, installation and interaction with your application in the testing environment, simulating production scenarios such as making API calls, putting your application behind an HTTP server, testing for scale and more. We will also talk about how to investigate failures, and how these tests can integrate easily with conventional unit-testing frameworks such as PyTest and nose. Attendees of this workshop should have intermediate Python knowledge.</span></p>\n<p><span><strong>Hardware Requirements </strong><br>\nOne Laptop with at least 8GB of RAM and 15 GB free disk space<br/><strong>Supported operating systems</strong><br/>\nRHEL 7.3, Fedora 24, Fedora 25, CentOS 7.3<br/><br/>\nWe will present the workshop on a projector so participants can see the workshop tasks even without installing the projects.<br/>\nWe’ll do our best to provide a few pre-installed laptops for people in need. Please make sure to mention you need a laptop when subscribing to the workshop. It is likely that not all requests will be answered.</br></span></p>", "speakers": [["Eyal Edri", "http://il.pycon.org/wwwpyconIL/speakers/76"], ["Nadav Goldin", "http://il.pycon.org/wwwpyconIL/speakers_info/155"]], "title": "Build a fully isolated virtualized end to end testing environment from Python", "track": "Track 2", "sessionId": 98, "video": null, "location": "Bar-Ilan CS lab 203 (Building 604 on the map)", "time": "Wed, 06/14/2017 - 09:00", "duration": "180min", "type": "Workshop"}, {"body": "<p><span><span><span><span><span><span><span><span><span><span><span><span><span><em><span><span>RNNs are the default architecture for \"deep NLP\" but their are numerous practical cases where convolutions are as effective while training faster and requiring fewer computational resources.</span></span></em></span></span></span></span></span></span></span></span></span></span></span></span></span><br><span>The first hour of this workshop will cover the convolutional operations we need to work with text including dilated convolutions, deconvolutions and tricks for managing gradients. We'll then use what we learnt to restore capitalization and punctuation to  text a common task when dealing with speech recognition. </span><br/><em>Please come prepared with a laptop, tensorflow and nltk installed. Python 3 is preferred. The materials for the workshop are <a href=\"https://github.com/talolard/CMFT_PyCon2017\">https://github.com/talolard/CMFT_PyCon2017</a></em></br></p>", "speakers": [["Tal Perry", "http://il.pycon.org/wwwpyconIL/speakers/78"]], "title": "Convolutional methods for Text in Tensorflow", "track": "PyData", "sessionId": 99, "video": null, "location": "Bar-Ilan CS lab 202 (Building 604 on the map)", "time": "Wed, 06/14/2017 - 09:00", "duration": "180min", "type": "Workshop"}, {"body": "", "speakers": [], "title": "Lunch break\t\t", "track": "Key Notes", "sessionId": 100, "video": null, "location": "Wohl Center, Main Hall", "time": "Wed, 06/14/2017 - 12:00", "duration": "60min", "type": "Lunch"}, {"body": "<p><span>We will try to get our hands dirty playing with python (micropython) on some wifi enabled (and/or bluetooth) micro-controllers, to build a project together.<br><br/>\nProposed project is a weather and air quality monitor station device with a full-color display showing the current values of the sensors as well. The device can send data upstream to a sensor network to share data with others.<br/><br/>\nWe will improve on work done at the PyCon FR workshop on the same subject.<br/><br/>\nPeople with their own ideas can come to the workshop too to learn how to do it (if you need specific hardware, bring it :)).</br></span></p>", "speakers": [["Jonathan Schemoul", "http://il.pycon.org/wwwpyconIL/speakers/73"]], "title": "Let's build a device together using Python! -- part II", "track": "Track 1", "sessionId": 101, "video": null, "location": "Bar-Ilan CS lab 201 (604 on the map)", "time": "Wed, 06/14/2017 - 13:00", "duration": "120min", "type": "Workshop"}, {"body": "<p><span>Kodi is a media-center software, designed to be displayed on large TV screens and controlled easily from the sofa. Kodi's flexible, Python based, add-on system effectively make it a general-purpose GUI platform, and provide a simple way to create a TV interface for web applications. </span></p>\n<p><span>In this workshop, we will start with the basics, and learn how to add a custom add-on and get it to run. Once the simple demo is running properly, it can be modified to show relevant data from the conference website. Hopefully, future sprints could expand and generalize that, providing for future PyCons an easy way to feature large screens, controlled by remotes, that would allow participants to browse the conference schedule and view videos from previous years. </span></p>\n<p><span>We need to keep contact with the participants, in order to send announcements and let you know what you need to prepare in advance. After registration, please join the forum: </span></p>\n<p><span><a href=\"https://groups.google.com/forum/#!forum/pyconil-kodi-workshop\">https://groups.google.com/forum/#!forum/pyconil-kodi-workshop</a> </span></p>\n<p><span>or email me <a href=\"mailto:aronovitch@gmail.com\">mailto:aronovitch@gmail.com</a></span></p>", "speakers": [["Amit Aronovitch", "http://il.pycon.org/wwwpyconIL/speakers/74"], ["Moshe Nahmias", "http://il.pycon.org/wwwpyconIL/speakers_info/75"]], "title": "PyCon-IL.TV: Kodi Add-on From Scratch", "track": "Track 2", "sessionId": 102, "video": null, "location": "Bar-Ilan CS lab 203 (Building 604 on the map)", "time": "Wed, 06/14/2017 - 13:00", "duration": "120min", "type": "Workshop"}, {"body": "<p><span>Sprinting on keras live with the worldwide keras developers community!</span></p>", "speakers": [["Yam Peleg", "http://il.pycon.org/wwwpyconIL/speakers/160"]], "title": "Keras Sprint!", "track": "PyData", "sessionId": 103, "video": null, "location": "Bar-Ilan CS lab 202 (Building 604 on the map)", "time": "Wed, 06/14/2017 - 13:00", "duration": "30min", "type": "Workshop"}, {"body": "", "speakers": [], "title": "Coffee Break", "track": "Key Notes", "sessionId": 104, "video": null, "location": "Bar-Ilan CS lab 201 (604 on the map)", "time": "Wed, 06/14/2017 - 15:00", "duration": "30min", "type": "Coffee"}, {"body": "<p><span>We will try to get our hands dirty playing with python (micropython) on some wifi enabled (and/or bluetooth) micro-controllers, to build a project together.<br><br/>\nProposed project is a weather and air quality monitor station device with a full-color display showing the current values of the sensors as well. The device can send data upstream to a sensor network to share data with others.<br/><br/>\nWe will improve on work done at the PyCon FR workshop on the same subject.<br/><br/>\nPeople with their own ideas can come to the workshop too to learn how to do it (if you need specific hardware, bring it :)).</br></span></p>", "speakers": [["Jonathan Schemoul", "http://il.pycon.org/wwwpyconIL/speakers/73"]], "title": "Let's build a device together using Python! -- part III", "track": "Track 1", "sessionId": 105, "video": null, "location": "Bar-Ilan CS lab 201 (604 on the map)", "time": "Wed, 06/14/2017 - 15:30", "duration": "90min", "type": "Workshop"}, {"body": "<p><span>Kodi is a media-center software, designed to be displayed on large TV screens<br>\nand controlled easily from the sofa. Kodi's flexible, Python based, add-on<br/>\nsystem effectively make it a general-purpose GUI platform, and provide a simple<br/>\nway to create a TV interface for web applications.<br/><br/>\nIn this workshop, we will start with the basics, and learn how to add a custom<br/>\nadd-on and get it to run. Once the simple demo is running properly, it can be<br/>\nmodified to show relevant data from the conference website.<br/><br/>\nHopefully, future sprints could expand and generalize that, providing for future<br/>\nPyCons an easy way to feature large screens, controlled by remotes, that would<br/>\nallow participants to browse the conference schedule and view videos from<br/>\nprevious years.<br/><br/>\nWe need to keep contact with the participants, in order to send announcements<br/>\nand let you know what you need to prepare in advance.<br/>\nAfter registration, please join the forum:<br/><a href=\"https://groups.google.com/forum/#!forum/pyconil-kodi-workshop\">https://groups.google.com/forum/#!forum/pyconil-kodi-workshop</a><br/>\nor email me <a href=\"mailto:aronovitch@gmail.com\">mailto:aronovitch@gmail.com</a></br></span></p>", "speakers": [["Amit Aronovitch", "http://il.pycon.org/wwwpyconIL/speakers/74"], ["Moshe Nahmias", "http://il.pycon.org/wwwpyconIL/speakers_info/75"]], "title": "PyCon-IL.TV: Kodi Add-on From Scratch -- part II", "track": "Track 2", "sessionId": 106, "video": null, "location": "Bar-Ilan CS lab 203 (Building 604 on the map)", "time": "Wed, 06/14/2017 - 15:30", "duration": "90min", "type": "Workshop"}, {"body": "<p><span>Sprinting on keras live with the worldwide keras developers community!</span></p>", "speakers": [["Yam Peleg", "http://il.pycon.org/wwwpyconIL/speakers/160"]], "title": "Keras Sprint! -- part II", "track": "PyData", "sessionId": 107, "video": null, "location": "Bar-Ilan CS lab 202 (Building 604 on the map)", "time": "Wed, 06/14/2017 - 15:30", "duration": "90min", "type": "Workshop"}]}