{"days": [{"date": "02-05-2016", "events": [{"eventId": 1, "speakers": [], "from": "2016-05-02T09:00:00", "name": "Arrival + snacks", "track": null, "text": "Registration and some light refreshment to start the day... which gonna be awesome!!", "deleted": false, "to": "2016-05-02T09:30:00", "version": "", "place": "Room 6", "experienceLevel": 0, "link": "", "type": 8, "order": null}, {"eventId": 2, "speakers": [], "from": "2016-05-02T09:30:00", "name": "Conference Opening", "track": null, "text": "The first PyCon Israel will be officially launched during this Grand Opening session", "deleted": false, "to": "2016-05-02T09:45:00", "version": "", "place": "Room 6", "experienceLevel": 0, "link": "", "type": 2, "order": null}, {"eventId": 3, "speakers": [1], "from": "2016-05-02T09:45:00", "name": "Keynote #1 - Scaling PyData Up and Out with Anaconda", "track": null, "text": "", "deleted": false, "to": "2016-05-02T10:30:00", "version": "", "place": "Room 6", "experienceLevel": 0, "link": "bH7UAQ3YKCk", "type": 2, "order": null}, {"eventId": 4, "speakers": [3, 4], "from": "2016-05-02T10:30:00", "name": "Keynote #2 - Growing Community That Makes a Difference", "track": null, "text": "", "deleted": false, "to": "2016-05-02T11:15:00", "version": "", "place": "Room 6", "experienceLevel": 0, "link": "99vpXHasxuI", "type": 2, "order": null}, {"eventId": 5, "speakers": [], "from": "2016-05-02T11:15:00", "name": "Break, move into tracks", "track": null, "text": "", "deleted": false, "to": "2016-05-02T11:30:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 3, "order": null}, {"eventId": 6, "speakers": [5], "from": "2016-05-02T11:30:00", "name": "What's new in PyPy and what will be next", "track": 1, "text": "PyPy is moving toward the goto solution for improving python performance. We are expanding our support for the python capi, can support much of the numpy python interface, and should have released a Python 3.3 compatible version by the time Pycon Israel happens<br/><br/>Attendees of the talk can see a full demo of PyPy on Windows, including installation of Numpy and running some scientific benchmarks.", "deleted": false, "to": "2016-05-02T12:00:00", "version": "", "place": "Room 6", "experienceLevel": 1, "link": "W8actDHtvWU", "type": 1, "order": null}, {"eventId": 7, "speakers": [13], "from": "2016-05-02T11:30:00", "name": "Network Analysis with Python", "track": 2, "text": "Extracting meaning from data is one of the biggest challenge in science and industry. We can see many types of network-like data in Nature and man-made systems from social networks to protein-protein interaction networks. Here, I would like to show the capabilities of NetworkX which is a package for creation, manipulation and studying complex networks with Python. The topics involved this presentation will be (i) a very brief introduction to NetworkX (also mentioning other relevant python packages); and (ii) real examples and use cases in the second part (community detection and visualization with python), with a little hands-on session.", "deleted": false, "to": "2016-05-02T12:00:00", "version": "", "place": "Room 8", "experienceLevel": 1, "link": "x6FyGFbvlBg", "type": 1, "order": null}, {"eventId": 8, "speakers": [6], "from": "2016-05-02T12:00:00", "name": "Practical Metaclasses and Descriptors", "track": 1, "text": "Python gives developers direct control over every stage of the OOP process. Metaclasses are the framework used in creating classes themselves and descriptors are what goes on behind the scene when you call a function or set an attribute. These programming tools are often considered to be among the black magic tools of expert python developers. However, they are not as scary as they look.<br/><br/>In this talk, I will explain how metaclasses work and present some practical examples, including a minimally invasive way to add full usage/error logging to your entire application.<br/><br/>When you leave my talk, you will have a newfound understanding of the power that metaclass programming and descriptor manipulation can give you.", "deleted": false, "to": "2016-05-02T12:30:00", "version": "", "place": "Room 6", "experienceLevel": 1, "link": "Nay7lRPwnC4", "type": 1, "order": null}, {"eventId": 9, "speakers": [14], "from": "2016-05-02T12:00:00", "name": "Wrestling Python into LLVM intermediate representation", "track": 2, "text": "What is LLVM-IR?<br/><br/>The LLVM Compiler Infrastructure Project provides a transportable intermediate representation (LLVM-IR) that can be compiled and linked into multiple types of assembly code. LLVM-IR is great because you can take any language and distill it into a form that can be run on many different machines. Once the code gets into IR it doesn’t matter what platform it was originally written on, and it doesn’t matter that Python can be slow. It doesn’t matter if you have weird CPUs - if they are supported by LLVM it will run.<br/><br/><br/>What is Tupleware?<br/><br/>TupleWare is an analytical framework built at Brown University that allows users to compile functions into distributed programs that are automatically deployed. TupleWare is unique because it uses LLVM-IR to be language and platform independent.<br/><br/><br/>What is PyLLVM?<br/><br/>This is the heart of the talk. PyLLVM is a simple, easy to extend, one-pass static compiler that takes in the subset of Python most likely to be used by Tupleware. PyLLVM is based on an existing project called py2llvm (https://code.google.com/archive/p/py2llvm) that was abandoned around 2011.<br/><br/>This talk will go through some basic compiler design and talk about how some LLVM-IR features make our lives easier, and some much harder. It will cover types, scoping, memory management, and other implementation details. To conclude, it will compare PyLLVM to Numba, a Python-to-LLVM compiler from Continuum Analytics and touch on what the future has in store for PyLLVM.<br/><br/><br/>Talk Objective<br/><br/>Attendees will learn what LLVM-IR is and how it can be leveraged to allow data scientists to write their algorithms in Python. They will leave with a high-level understanding of the design process and considerations of writing a simple compiler. Last, they will know all about how PyLLVM coaxes Python code into LLVM-IR. It will become evident how cool LLVM and Python can be when they work together!", "deleted": false, "to": "2016-05-02T12:30:00", "version": "", "place": "Room 8", "experienceLevel": 2, "link": "ZWKYtTUFfvs", "type": 1, "order": null}, {"eventId": 10, "speakers": [], "from": "2016-05-02T12:30:00", "name": "Lunch Break", "track": null, "text": "", "deleted": false, "to": "2016-05-02T13:30:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 4, "order": null}, {"eventId": 11, "speakers": [7], "from": "2016-05-02T13:30:00", "name": "Debugging Hung Python Processes With GDB", "track": 1, "text": "Complex Python programs can be rather difficult to debug when hung. Finding out why a 500k lines process is completely stuck can be a daunting task, especially since PDB can't be attached to the stuck process in order to display rudimentary details such as local/global variables, stack traces and more. However, this can be mitigated greatly by tools such as GDB and strace. This talk will focus on such methods that will surely help you debug such programs", "deleted": false, "to": "2016-05-02T14:00:00", "version": "", "place": "Room 6", "experienceLevel": 1, "link": "CVr0uBtKs7o", "type": 1, "order": null}, {"eventId": 12, "speakers": [15], "from": "2016-05-02T13:30:00", "name": "Algorithms to Sample From Streams - Reservoir Sampling & Variants", "track": 2, "text": "Those of us who build systems that deal with constant streams of incoming data (which includes anybody whose code touches the internet) often need algorithms that keep a fixed-size sample from the stream for on-the-fly analytics.<br/><br/>Reservoir sampling is a commonly used algorithm for keeping a sample that's unbiased over all events in the stream. But what if you want your algorithm to keep a representative sample from the past 10 minutes instead of the entire stream?<br/><br/>In this talk I'll start with a gentle introduction to Reservoir sampling for those who are not familiar with it, and then discuss several variants which keep a sample that is biased towards the present. One of these is the VIRB (Variable Incoming Rate Biased) sampler, which we have developed in-house at Magnetic.", "deleted": false, "to": "2016-05-02T14:00:00", "version": "", "place": "Room 8", "experienceLevel": 1, "link": "s_Za9GlD0ek", "type": 1, "order": null}, {"eventId": 13, "speakers": [12], "from": "2016-05-02T14:00:00", "name": "Introduction to JSON Schema", "track": 1, "text": "JSON Schema (http://json-schema.org) is an increasingly popular, cross-language specification for schematization of JSON documents. It represents schema constraints on a JSON document as a JSON document, in a flexible validation language.<br/><br/>We'll investigate some simple (and not so simple) examples of data validation using the jsonschema Python package (https://pypi.python.org/pypi/jsonschema), which implements the specification.", "deleted": false, "to": "2016-05-02T14:30:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "7kbTAMrxs_8", "type": 1, "order": null}, {"eventId": 14, "speakers": [16], "from": "2016-05-02T14:00:00", "name": "Pandas for non-data scientists", "track": 2, "text": "This is not a tutorial. It's an attempt to expose non data scientists experiencied pythonistas to the powerful pandas library. Most of python developers don't use pandas (either because they never heard of it, felt that it's a too steep learning curve or never thought that it will be useful for them). I intend to talk about python performance limitations and show how pandas can be used to overcome some of these limitations.", "deleted": false, "to": "2016-05-02T14:30:00", "version": "", "place": "Room 8", "experienceLevel": 2, "link": "LakHpMkEXKk", "type": 1, "order": null}, {"eventId": 15, "speakers": [8], "from": "2016-05-02T14:30:00", "name": "PyTest, the testing framework you've been dreaming of", "track": 1, "text": "An introduction to PyTest enabling people a simple start with it as well getting the information about its strengths and features", "deleted": false, "to": "2016-05-02T15:00:00", "version": "", "place": "Room 6", "experienceLevel": 1, "link": "l0zjVKD7rx8", "type": 1, "order": null}, {"eventId": 16, "speakers": [17], "from": "2016-05-02T14:30:00", "name": "From Experimentation to Production: Pandas and Sci-Kit learn on Azure ML", "track": 2, "text": "Pandas and Sci-Kit learn are powerful open source data science and machine learning toolkits. However, putting them into production is not as seamless as it could be.<br/><br/>In this talk attendees will learn how to build, visualize and connect Pandas and SciKit learn ensemble models into an Azure ML pipeline for experimentation and production.", "deleted": false, "to": "2016-05-02T15:00:00", "version": "", "place": "Room 8", "experienceLevel": 2, "link": "QBqJX84eUc8", "type": 1, "order": null}, {"eventId": 17, "speakers": [], "from": "2016-05-02T15:00:00", "name": "Coffee break", "track": null, "text": "", "deleted": false, "to": "2016-05-02T15:30:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 3, "order": null}, {"eventId": 18, "speakers": [18], "from": "2016-05-02T15:00:00", "name": "How to Study Evolution Using Scientific Python", "track": 2, "text": "Evolution takes place in large populations over long time and geographic scales. Due to these constraints, mathematical and computational approaches have been used to study evolution since the 1920's, leading to important developments in modern statistics, mathematics, and computer science.<br/><br/>In this talk we will see how Scientific Python can be used to study evolutionary theory using mathematical and computational models. We'll see how to run fast evolutionary simulations with NumPy, analyze and visualize simulation results with Pandas and Seaborn, and find solutions to evolutionary models using SciPy and SymPy. Everything will be done in an open GitHub repo and presented using an online Jupyter Notebook to allow listeners to participate.<br/><br/>This talk is a wonderful opportunity to discover how theoretical evolutionary biologists approach their research, as well as an occasion to learn about Scientific Python through actual research-based examples.", "deleted": false, "to": "2016-05-02T15:30:00", "version": "", "place": "Room 8", "experienceLevel": 2, "link": "2w8Tv016Frw", "type": 1, "order": null}, {"eventId": 19, "speakers": [9], "from": "2016-05-02T15:30:00", "name": "The Many Faces of Concurrency in Python", "track": 1, "text": "The talk will be about the many ways to achieve concurrency in Python, including multi-threading, multi-processing, gevent, and maybe even asyncio / python 3.5's async-await. The talk will include examples from our experience developing a scale-out system for managing huge cellular networks in pure python.", "deleted": false, "to": "2016-05-02T16:00:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "ZcR9Sbk18kk", "type": 1, "order": null}, {"eventId": 20, "speakers": [], "from": "2016-05-02T15:30:00", "name": "Coffee break", "track": null, "text": "", "deleted": false, "to": "2016-05-02T16:00:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 3, "order": null}, {"eventId": 21, "speakers": [10], "from": "2016-05-02T16:00:00", "name": "How to make Python perform like C", "track": 1, "text": "The talk will present several strategies and tools that will allow Python code to run as lower-level code. Will touch on JIT vs. AOT compilers, which are the task suitable to be compiled so as to perform faster than native Python? How can one annotate Python to speed up compiled Python code?<br/><br/>Optionally (time permitting): writing Python modules in C or Fortran, and using libraries from C or Fortran in Python.", "deleted": false, "to": "2016-05-02T16:30:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "EK3-M8KIun0", "type": 1, "order": null}, {"eventId": 22, "speakers": [36], "from": "2016-05-02T16:00:00", "name": "Poetry in Python: Using Markov Chains to Generate Texts", "track": 2, "text": "Markov chains are an incredibly simple way to understand text and speech. In this talk, Omer will implement Markov chains, train them on different data and try to let python create new texts on it's own. Let's see how well this basic method does in creating texts that simulate poetry, famous books and other interesting things. The results might surprise you..", "deleted": false, "to": "2016-05-02T16:30:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "-51qWZdA8zM", "type": 1, "order": null}, {"eventId": 23, "speakers": [11], "from": "2016-05-02T16:30:00", "name": "Introduction to app development with OpenStack SDK", "track": 1, "text": "Ever thought about what it takes to write a scalable cloud application using an OpenStack SDK? My talk is aiming to introduce the audience to the 'magicness' of the OpenStack SDK to develop applications that could use effectively all the features exposed.<br/><br/>This talk is a way to evangelize people to use the proper tools and getting in touch with what's already out there instead to rewrite everything from scratch or reinvent the wheel.<br/><br/>At the end of the talk the audience will see and 'touch' how easy is to write from scratch an application and make use of it, immediately using for example the trystack environment.<br/>Since the talk time is 30 minutes, there will be a template on github from what to start and at the end the working apps.", "deleted": false, "to": "2016-05-02T17:00:00", "version": "", "place": "Room 6", "experienceLevel": 0, "link": "b6wVfaQvH3M", "type": 1, "order": null}, {"eventId": 24, "speakers": [32], "from": "2016-05-02T16:30:00", "name": "If They Build It... They will code...(lessons from a school coding club)", "track": 3, "text": "Why do people say \"I don’t like programming\" without having tried it? Could it be that we are not teaching the right stuff? For the past year, Rony Sheer has been running the Code4Change hacking program at Tichonet High School and has lessons from the trenches. How do you teach teenagers to build Django apps together? How can agile methodology change education? What happens when you stop teaching “programming” and start teaching “making”? This is a talk about our role in introducing young people to code.", "deleted": false, "to": "2016-05-02T17:00:00", "version": "", "place": "Room 8", "experienceLevel": 1, "link": "QGHz5TwvpDY", "type": 1, "order": null}, {"eventId": 25, "speakers": [], "from": "2016-05-02T17:00:00", "name": "After Party", "track": null, "text": "", "deleted": false, "to": "2016-05-02T18:45:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 10, "order": null}, {"eventId": 26, "speakers": [], "from": "2016-05-02T18:45:00", "name": "Surprise", "track": null, "text": "", "deleted": false, "to": "2016-05-02T20:00:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 11, "order": null}]}, {"date": "03-05-2016", "events": [{"eventId": 27, "speakers": [], "from": "2016-05-03T09:00:00", "name": "Arrival + snacks", "track": null, "text": "Day 2, guys!", "deleted": false, "to": "2016-05-03T09:25:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 3, "order": null}, {"eventId": 28, "speakers": [], "from": "2016-05-03T09:24:00", "name": "Welcome to day 2", "track": null, "text": "Fast your seat belt, and join us for PyCon Israel Day 2!", "deleted": false, "to": "2016-05-03T09:30:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 2, "order": null}, {"eventId": 29, "speakers": [2], "from": "2016-05-03T09:30:00", "name": "Keynote #3", "track": null, "text": "Topic to be announced", "deleted": false, "to": "2016-05-03T10:15:00", "version": "", "place": "", "experienceLevel": 0, "link": "lIDVIQht_xs", "type": 2, "order": null}, {"eventId": 30, "speakers": [], "from": "2016-05-03T10:15:00", "name": "Break, move into tracks", "track": null, "text": "", "deleted": false, "to": "2016-05-03T10:30:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 3, "order": null}, {"eventId": 31, "speakers": [8], "from": "2016-05-03T10:30:00", "name": "Type hints in Python", "track": 1, "text": "Short intro for the new feature of Python 3.5 and how it can improve your Python coding", "deleted": false, "to": "2016-05-03T11:00:00", "version": "", "place": "Room 6", "experienceLevel": 1, "link": "ZshdRGoYV1U", "type": 1, "order": null}, {"eventId": 32, "speakers": [26], "from": "2016-05-03T10:30:00", "name": "Getting started with ChatOps in Python with Errbot", "track": 4, "text": "ChatOps is about bringing your devops tools into your team chatroom.<br/><br/>The recent rise of professional chatting services like Slack or Hipchat shows that people are embracing a new way of collaborating. Bringing your tools within those conversations tightens the feedback loop, improves information sharing and onboarding new people in your team.<br/><br/>Some common operations implemented with chatops includes deployments, provisioning, monitoring, graphs, development tracking...<br/><br/>Those are  often implemented with the help of a chat bot like in this presentation Errbot.<br/>If your chatops system can be easily extended, for example here in Python, we will see that a team culture can crystallize around it with fun additions.<br/><br/>This presentation's goal is to show you how easy it is to get started with chatops in Python, with some technical tips (installation, security, architecture...) but also some social tips to make your company understand better its potential for your team.", "deleted": false, "to": "2016-05-03T11:00:00", "version": "", "place": "Room 8", "experienceLevel": 1, "link": "KnnlqR2h2ug", "type": 1, "order": null}, {"eventId": 33, "speakers": [19], "from": "2016-05-03T11:00:00", "name": "Python In The Serverless Era", "track": 1, "text": "Serverless Architecture is considered to be the successor of PaaS model and is the next phase in the evolution of cloud development. As one of only 3 languages supported by AWS Lambda, these are very exciting times for Python. This talk will review the serverless ecosystem, use cases and the role Python plays in it.", "deleted": false, "to": "2016-05-03T11:30:00", "version": "", "place": "Room 6", "experienceLevel": 1, "link": "IjlrDMdthkM", "type": 1, "order": null}, {"eventId": 34, "speakers": [35], "from": "2016-05-03T11:00:00", "name": "Quick and robust CLI creation with Click module", "track": 4, "text": "Ilia show how we can create very quickly rich CLI front-end for Python programs. Then I will explain how we can make this CLI expandable and Independent from back-end.<br/><br/>Attendees will gain knowledge how to use Python Click module in order to create powerful, easily expandable and maintainable front-end for their programs in a very quick way.", "deleted": false, "to": "2016-05-03T11:30:00", "version": "", "place": "Room 8", "experienceLevel": 1, "link": "6zPXWhG13RY", "type": 1, "order": null}, {"eventId": 35, "speakers": [20], "from": "2016-05-03T11:30:00", "name": "CPython byte-code and code-injection", "track": 1, "text": "Want to know what makes CPython interpreter's engine tick? How about modifying Python's bytecode or maybe modifying it live in another running Python process ?<br/><br/>In this talk we will go into what is in a Python .pyc file and how CPython executes that bytecode (mainly by looking at the code object).<br/>br</>Afterwards we will talk about how to make simple modifications to the bytecode in order to insert hook points into preexisting code. We will see how we can use pyrasite for inspecting and modifying an already running Python process (useful for debugging long-running servers or detecting memory leaks).<br/><br/>Finally, we will survey some more generic Python bytecode modifiers and code injectors.<br/><br/>Bonus points - How can CPython 2 (but not 3) can create valid yet unusable or wrong .pyc files from .py files ?<br/><br/>The talk will be based mainly on CPython 2.7.<br/><br/>(1) bytehook<br/>https://github.com/tzickel/bytehook<br/><br/>(2) pyrasite<br/>https://github.com/lmacken/pyrasite<br/><br/>(3) codetransformer<br/>https://github.com/llllllllll/codetransformer<br/><br/>(4) PTVS code injector<br/>https://github.com/Microsoft/PTVS/blob/0a3d9d17008e8d9b8fe2cb40c6c501f13861ccdb/Python/Product/PyDebugAttach/PyDebugAttach.cpp<br/><br/>(5) that 20 years unclosed python 2 bug mentioned in the bonus points:)<br/>https://bugs.python.org/issue25083<br/><br/>+ another timing quirk not documented", "deleted": false, "to": "2016-05-03T12:00:00", "version": "", "place": "Room 6", "experienceLevel": 3, "link": "J7E6hKCGh4k", "type": 1, "order": null}, {"eventId": 36, "speakers": [28], "from": "2016-05-03T11:30:00", "name": "Building Python with Bazel", "track": 4, "text": "Bazel is a build system recently open sourced by Google. Even though Python doesn't require \"building\" in the traditional way like C++, large code bases can benefit from Bazel's features. Bazel provides powerful tools for expressing and querying dependencies—even between systems in different languages. It also makes it possible to bundle applications with all of their dependencies into a hermetic package for distribution. This talk will cover 1) an introduction to Bazel and how it differs from other build systems, 2) how Bazel can be used with Python, and 3) the limitations of Bazel.", "deleted": false, "to": "2016-05-03T12:00:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "i2Gu7lMVeEw", "type": 1, "order": null}, {"eventId": 37, "speakers": [21], "from": "2016-05-03T12:00:00", "name": "Fight or Flight? - dealing with real world applications in Python", "track": 1, "text": "You have just landed a new job as a hero Python developer.<br/><br/>Your first task is simple. Make a little tweak to an existing application.<br/><br/>To your horror you discover the code is a mess written in the past 10 years by many different people who have just started their career as Python programmers. They all have already move on. They left behind the code, but it has no tests and no documentation.<br/><br/>Oh and by the way, the company depends on the application.<br/><br/>What do you do now? Fight or flight?<br/><br/>In this talk you will hear about a couple of ways to fight with such a beast.", "deleted": false, "to": "2016-05-03T12:30:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "z0XHW9nYpv8", "type": 1, "order": null}, {"eventId": 38, "speakers": [29], "from": "2016-05-03T12:00:00", "name": "Hacking the Selenium WebDriver", "track": 4, "text": "In this talk we would dive into the the heart of the Selenium WebDriver's python implementation. WebDriver is the de-facto automation standard for the web, and quite recently a rising start in mobile automation as well (via Appium). We will briefly describe the WebDriver wire protocol, which is the API layer of the automation, and see its python implementation. We will build a quick SDK wrapping the WebDriver class: It will be able to record (and export) actions done using a WebDriver instance, which can later be viewed or replayed by external tools.", "deleted": false, "to": "2016-05-03T12:30:00", "version": "", "place": "Room 8", "experienceLevel": 2, "link": "xpS4KJ-2npA", "type": 1, "order": null}, {"eventId": 39, "speakers": [], "from": "2016-05-03T12:30:00", "name": "Lunch Break", "track": null, "text": "", "deleted": false, "to": "2016-05-03T13:30:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 4, "order": null}, {"eventId": 40, "speakers": [22], "from": "2016-05-03T13:30:00", "name": "When Regular Expressions are Not Enough", "track": 1, "text": "Handling input languages like XML, YAML, or JSON is simple enough, just grab your favorite module and hammer it out. But what should one do when facing a more obscure markup language, configuration file or another artifact of a developer with acute NIH syndrome?<br/><br/>In this talk we'll (quickly) revisit formal languages basics and what can and cannot be parsed. We will then introduce 'parsimonious', a simple, fast, and economic Parsing Expression Grammar parser written by Eric Rose.", "deleted": false, "to": "2016-05-03T14:00:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "sPHtJztMUeY", "type": 1, "order": null}, {"eventId": 41, "speakers": [30], "from": "2016-05-03T13:30:00", "name": "When Dependencies between Test Cases are Inevitable or How to test Image Instances in the Cloud", "track": 4, "text": "You need to test your images on various instance types in the cloud, but which tools do you use? How to run dozens of thousands of test cases on hundreds of machines in the cloud in parallel? Is it OK to have dependencies between test cases to make this task less expensive?<br/><br/>Dva is an open source validation tool which is applicable to various images and instance types. Using your image, it will launch instances of different types in defined regions and will execute test cases in parallel. How? All test cases are represented as a Directed Acyclic Graph structure – parents and children. Then these test cases are assigned to workers by a modified BFS algorithm that allows processing of sibling test cases in parallel. It includes test result processing tools such as a Bugzilla module to report bugs for you. 3rd-party test case modules are supported too.<br/><br/>This tool is used by Red Hat QE for RHEL image release sanity testing in EC2, however Fedora images and OpenStack cloud are supported too. To test a RHEL release, Dva launches hundreds of machines of various types in all EC2 regions and executes a set of nearly 70 test cases with dependencies on every machine in parallel.<br/><br/>Source Code/Home page: https://github.com/RedHatQE/dva/<br/><br/>Topics: Open Source, Cloud, QA/QE, Automation, Python", "deleted": false, "to": "2016-05-03T14:00:00", "version": "", "place": "Room 8", "experienceLevel": 2, "link": "tEu624QSYYo", "type": 1, "order": null}, {"eventId": 42, "speakers": [34], "from": "2016-05-03T14:00:00", "name": "Python as a brain for your devices (web developement, hardware \"IoT\", etc.)", "track": 1, "text": "How do you talk between python and embedded apps ? I'll show an example using the very popular ESP8266 micro-controller, with popular messaging protocols (json, mqtt, etc.) and web interface using react and material UI.", "deleted": false, "to": "2016-05-03T14:30:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "BcdNe6b1lyM", "type": 1, "order": null}, {"eventId": 43, "speakers": [31], "from": "2016-05-03T14:00:00", "name": "Running upstream Spacewalk tests using Ansible and Vagrant", "track": 4, "text": "We have many tests for our product running in our test lab managed by Beaker. Unfortunately our community do not have access to this environment. And it would be too complicated for them to set up the same environment to test their contributions to upstream project.<br/><br/>But we can provide them easy to use solution with Vagrant and Ansible. Vagrant is a tool for creating and configuring virtual development environment. And Ansible is configuration and management tool what can be used to configure Vagrant systems. I will introduce these projects, and show practical example how to use them to to set up testing environment for community contributing to upstream project of our enterprise application.", "deleted": false, "to": "2016-05-03T14:30:00", "version": "", "place": "Room 8", "experienceLevel": 1, "link": "PyAdWxAQ6FU", "type": 1, "order": null}, {"eventId": 44, "speakers": [24], "from": "2016-05-03T14:30:00", "name": "Deep dive into threat detection in the cloud with Spark and Python", "track": 5, "text": "Machine learning is all over the place. In the cyber space, it's one of the biggest buzzwords of 2015 and most prominent tools used to detect anomalies, in particular when involved in User Behavior Analysis. This talk is a journey inside the cyber security techniques put in place at CloudLock to detect anomalies using Python. We will start our journey by looking at the data collection and processing implemented mostly inside celery tasks in order to produce a clean and enriched feed of billions of events daily. We will then present our use of Apache Spark MLLib with python and how we leverage AWS Lambda and EMR in our flexible infrastructure. Finally, we will show an example of data visualization around our threat map.<br/><br/>We will also discuss the pros and cons of using Python with Apache Spark when dealing with scale as well as Docker as a way to encapsulate some parts of the data pipeline and to serve the models to the application.<br/><br/>Come learn how to build an efficient ETL at scale using Python all the way!", "deleted": false, "to": "2016-05-03T15:00:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "VR7ivBD_NaM", "type": 1, "order": null}, {"eventId": 45, "speakers": [23], "from": "2016-05-03T14:30:00", "name": "Packaging / dependency hell in Python", "track": 4, "text": "In this talk we will discuss packing, dependencies and deploying apps in python.<br/><br/>We all love python, The syntax is simple and expressive, it has tons of open source modules and frameworks and a great community.<br/><br/>However one of pythons biggest pitfalls is the lack of clear way for deploying python apps.<br/><br/>We will discuss and show packaging, dependency management and deployment solutions in Python.<br/><br/>The talk will be separated to four short parts:<br/><br/>1. Python packaging pitfalls<br/>2. What can python learn from NPM<br/>3. Our current solutions: from DEB/RPM to Docker<br/>4. What new in Python 3.X and packaging (venv, ensurepip, zipapp)", "deleted": false, "to": "2016-05-03T15:00:00", "version": "", "place": "Room 8", "experienceLevel": 1, "link": "1vwv5TeItm8", "type": 1, "order": null}, {"eventId": 46, "speakers": [], "from": "2016-05-03T15:00:00", "name": "Coffee Break", "track": null, "text": "", "deleted": false, "to": "2016-05-03T15:30:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 3, "order": null}, {"eventId": 47, "speakers": [33], "from": "2016-05-03T15:00:00", "name": "Generating, automating and processing 3D graphics with Blender's python API", "track": 6, "text": "Python is often used as a scripting language within graphics software. One of these is the open source 3D animation program Blender, which has a powerful python API that can be extended with any python library. At Invertex, we use this tool to automatically analyze 3D scans and generate custom products, in some cases ready for 3D printing. This talk will provide a short overview of Blender and its python API, and demonstrate how to use it with a few short examples.", "deleted": false, "to": "2016-05-03T15:30:00", "version": "", "place": "Room 8", "experienceLevel": 2, "link": "FB0TY51Hid0", "type": 1, "order": null}, {"eventId": 48, "speakers": [25], "from": "2016-05-03T15:30:00", "name": "Optimizing Latency", "track": 5, "text": "Any growing startup will at some point face the problem of making their product work fast enough to provide a good user experience. At Desti, we had to get our search from taking multiple seconds to an average of 300ms.<br/><br/>To achieve that goal, we developed a tool and methodology for measurement, and employed multiple techniques of optimization. We improved our architecture, system design, and implementation before reaching that goal.<br/><br/>In this talk, I’ll share our measurement tool and methodology, and the optimization techniques we used.", "deleted": false, "to": "2016-05-03T16:00:00", "version": "", "place": "Room 6", "experienceLevel": 2, "link": "ZFwO2Reye2w", "type": 1, "order": null}, {"eventId": 49, "speakers": [], "from": "2016-05-03T15:30:00", "name": "Coffee Break", "track": null, "text": "", "deleted": false, "to": "2016-05-03T16:00:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 3, "order": null}, {"eventId": 50, "speakers": [], "from": "2016-05-03T16:15:00", "name": "Conference closing session", "track": null, "text": "", "deleted": false, "to": "2016-05-03T17:00:00", "version": "", "place": "", "experienceLevel": 0, "link": "", "type": 2, "order": null}]}]}
